# Path: umtoken/langs/bg.py

from umtoken.rules import RegexOp
from umtoken.langs.utils import DEFAULT_RULES, suffix_rules, interfix_rules

_lang = 'bg'

BG_RULES = (DEFAULT_RULES + 
            suffix_rules(_lang, ['o','oто','а','ат','ата','ах','аха','ахме','ахте','е','еве','евете','ем','ета','етата','ете','ето','ех','еха','ехме','ехте','еш','еше','и','им','ите','их','иха','ихме','ихте','иш','й','йове','йовете','м','ме','о','ове','овете','ото','ох','оха','охме','охте','та','те','х','ха','хме','хте','ш','ше','ът','я','ят','ята','ях','яха','яхме','яхте']) +
            [])
