# Path: umtoken/langs/bg.py

from umtoken.rules import RegexOp
from umtoken.langs.utils import DEFAULT_RULES, suffix_rules, interfix_rules

_lang = 'bg'

BG_RULES = (DEFAULT_RULES + 
            suffix_rules(_lang, ['o','oто','а','ал','ала','алата','али','алите','алия','алият','ало','алото','ан','ана','аната','ане','анета','анетата','ането','ани','аните','ания','аният','анията','ано','аното','ат','ата','атата','ати','атите','атия','атият','ато','атото','ах','аха','ахме','ахте','ащ','аща','ащата','ащи','ащите','ащия','ащият','ащо','ащото','е','еве','евете','ейки','ел','ела','ели','елите','елия','елият','ело','ем','ен','ена','ената','ене','енета','енетата','енето','ени','ените','ения','еният','енията','ено','еното','ета','етата','ете','ето','ех','еха','ехме','ехте','еш','еше','ещ','еща','ещата','ещи','ещите','ещия','ещият','ещо','ещото','и','ил','ила','илата','или','илите','илия','илият','ило','илото','им','ите','их','иха','ихме','ихте','иш','й','йки','йове','йовете','л','ла','лата','ли','лите','лия','лият','ло','лото','м','ме','н','на','ната','не','нета','нетата','нето','ни','ните','ния','ният','нията','но','ното','о','ове','овете','ото','ох','оха','охме','охте','т','та','тата','те','ти','тите','тия','тият','то','тото','х','ха','хме','хте','ш','ше','шейки','щ','ща','щата','щи','щите','щия','щият','що','щото','ъл','ът','я','ял','яла','ялата','яли','ялите','ялия','ялият','яло','ялото','ян','яна','яната','яни','яните','яния','яният','яно','яното','ят','ята','ях','яха','яхме','яхте','ящ','яща','ящата','ящи','ящите','ящия','ящият','ящо','ящото']) +
            [])
