# Path: umtoken/langs/el.py

from umtoken.rules import RegexOp
from umtoken.langs.utils import DEFAULT_RULES, suffix_rules, interfix_rules

_lang = 'el'

EL_RULES = (DEFAULT_RULES + 
            suffix_rules(_lang, ['ά','άδες','άδων','άει','άκι','άκια','άμε','άν','άνε','άς','άτε','άτων','άω','έ','έα','έας','έδες','έδων','έος','ές','έων','ή','ήθηκα','ήθηκαν','ήθηκε','ήθηκες','ήκαμε','ήκαν','ήκανε','ήκατε','ής','ήσαμε','ήσανε','ήσατε','ήσει','ήστε','ί','ία','ίο','ίου','ίων','α','αμε','αν','ανε','ας','ατα','ατε','ατος','ε','εί','εία','είας','είες','είς','είσαι','είστε','είται','είτε','ει','εις','ειών','ες','εσαι','εστε','εται','ετε','εων','εως','η','ηθήκαμε','ηθήκαν','ηθήκανε','ηθήκατε','ηθεί','ηκα','ηκαν','ηκε','ηκες','ημένη','ημένο','ημένος','ης','ησα','ησαν','ησε','ησες','ιά','ιάς','ιέμαι','ιές','ιέσαι','ιέστε','ιέται','ικά','ικές','ική','ικής','ικοί','ικού','ικούς','ικό','ικός','ικών','ιοί','ιού','ιούνται','ιούς','ιόμαστε','ιών','ο','οι','ομαι','ονται','οντας','ος','οτήτων','ου','ουμε','ουν','ουνε','ους','ούμαι','ούμαστε','ούμε','ούμενη','ούμενο','ούμενος','ούν','ούνε','ούνται','ούς','τές','τή','τήκαμε','τήκαν','τήκανε','τήκατε','τής','τε','τεί','τηκα','τηκαν','τηκε','τηκες','τρια','τριας','τριες','τών','υτήτων','ω','ων','όμαστε','όμενη','όμενο','όμενος','όσαστε','ότατη','ότατο','ότατος','ότερα','ότερες','ότερη','ότερης','ότερο','ότεροι','ότερος','ότερου','ότερους','ότερων','ότητα','ότητας','ότητες','ύ','ύς','ύτερη','ύτερο','ύτερος','ύτητα','ύτητας','ύτητες','ώ','ών','ώντας','ώς']) +
            interfix_rules(_lang, ['ο']) +
            [])
