# Path: umtoken/langs/el.py

from umtoken.rules import RegexOp
from umtoken.langs.utils import DEFAULT_RULES, suffix_rules, interfix_rules

_lang = 'el'

EL_RULES = (DEFAULT_RULES + 
            suffix_rules(_lang, ['ά','άει','άμε','άν','άνε','άς','άτε','άτων','άω','έα','έας','έος','ές','έων','ή','ήθηκα','ήθηκαν','ήθηκε','ήθηκες','ήκαμε','ήκαν','ήκανε','ήκατε','ής','ήσαμε','ήσατε','ήσει','ί','ία','ίο','ίου','ίων','α','αμε','αν','ανε','ας','ατα','ατε','ατος','ε','εί','εία','είας','είες','είς','είσαι','είστε','είται','είτε','ει','εις','ειών','ες','εσαι','εστε','εται','ετε','εων','εως','η','ηθήκαμε','ηθήκαν','ηθήκανε','ηθήκατε','ηθεί','ηκα','ηκαν','ηκε','ηκες','ημένη','ημένο','ημένος','ης','ησα','ησαν','ησανε','ησε','ησες','ιά','ιάς','ιέμαι','ιές','ιέσαι','ιέστε','ιέται','ιοί','ιού','ιούνται','ιούς','ιόμαστε','ιών','ο','οι','ομαι','ονται','οντας','ος','ου','ουμε','ουν','ους','ούμαι','ούμαστε','ούμε','ούμενη','ούμενο','ούμενος','ούν','ούνε','ούνται','ούς','τήκαμε','τήκαν','τήκανε','τήκατε','τεί','τηκα','τηκαν','τηκε','τηκες','ω','ων','όμαστε','όσαστε','ύ','ύς','ώ','ών','ώντας']) +
            [])
